apps/api/scripts/performance/load-test-tracking.yml
# Load Testing Configuration for Tracking Endpoints
# Story 3.5: Performance Validation & Optimization
#
# Tests tracking systems under expected load:
# - 1000 concurrent users
# - 10,000 Web Vitals events per hour
# - 100 error reports per hour

config:
  target: '{{ $processEnvironment.API_BASE_URL }}'
  phases:
    # Warm-up phase
    - duration: 60
      arrivalRate: 10
      name: 'Warm-up'

    # Ramp-up to expected load
    - duration: 120
      arrivalRate: 10
      rampTo: 50
      name: 'Ramp-up'

    # Sustained load - 10,000 events/hour = ~2.78 events/second
    - duration: 300
      arrivalRate: 50
      name: 'Sustained load'

    # Spike test
    - duration: 60
      arrivalRate: 100
      name: 'Spike test'

    # Cool down
    - duration: 60
      arrivalRate: 10
      name: 'Cool down'

  processor: './load-test-processor.js'

  # Performance thresholds
  ensure:
    maxErrorRate: 1 # Max 1% error rate
    p95: 300 # P95 latency < 300ms
    p99: 500 # P99 latency < 500ms

  plugins:
    expect: {}
    metrics-by-endpoint:
      stripQueryString: true

scenarios:
  # Web Vitals reporting
  - name: 'Report Web Vitals'
    weight: 90 # 90% of traffic
    flow:
      - post:
          url: '/api/tracking/web-vitals'
          headers:
            Content-Type: 'application/json'
          json:
            type: 'web-vitals'
            sessionId: '{{ $randomString() }}'
            timestamp: '{{ $timestamp }}'
            url: 'https://example.com{{ $randomPath() }}'
            userAgent: 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36'
            data:
              name: '{{ $randomMetric() }}'
              value: '{{ $randomNumber(100, 3000) }}'
              rating: '{{ $randomRating() }}'
              id: '{{ $randomString() }}'
              navigationType: 'navigate'
              delta: '{{ $randomNumber(1, 100) }}'
          expect:
            - statusCode: 200
            - contentType: json
            - hasProperty: success

  # Error reporting
  - name: 'Report Frontend Error'
    weight: 10 # 10% of traffic
    flow:
      - post:
          url: '/api/tracking/errors'
          headers:
            Content-Type: 'application/json'
          json:
            type: '{{ $randomErrorType() }}'
            sessionId: '{{ $randomString() }}'
            timestamp: '{{ $timestamp }}'
            url: 'https://example.com{{ $randomPath() }}'
            userAgent: 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36'
            error:
              message: '{{ $randomErrorMessage() }}'
              name: '{{ $randomErrorName() }}'
              stack: "Error: Test error\n    at Object.<anonymous> (/app/main.js:10:15)"
            context:
              route: '{{ $randomPath() }}'
              action: '{{ $randomAction() }}'
          expect:
            - statusCode: 200
            - contentType: json
            - hasProperty: success

  # Batch Web Vitals reporting
  - name: 'Report Batch Web Vitals'
    weight: 5
    flow:
      - post:
          url: '/api/tracking/web-vitals'
          headers:
            Content-Type: 'application/json'
          json:
            type: 'web-vitals-batch'
            sessionId: '{{ $randomString() }}'
            timestamp: '{{ $timestamp }}'
            url: 'https://example.com{{ $randomPath() }}'
            metrics:
              - name: 'LCP'
                value: '{{ $randomNumber(1000, 3000) }}'
                rating: 'good'
                id: '{{ $randomString() }}'
              - name: 'FID'
                value: '{{ $randomNumber(10, 100) }}'
                rating: 'good'
                id: '{{ $randomString() }}'
              - name: 'CLS'
                value: '{{ $randomNumber(0, 100) }}'
                rating: 'good'
                id: '{{ $randomString() }}'
          expect:
            - statusCode: 200

  # Batch error reporting
  - name: 'Report Batch Errors'
    weight: 2
    flow:
      - post:
          url: '/api/tracking/errors'
          headers:
            Content-Type: 'application/json'
          json:
            sessionId: '{{ $randomString() }}'
            errors:
              - type: 'error'
                sessionId: '{{ $randomString() }}'
                timestamp: '{{ $timestamp }}'
                url: 'https://example.com/page1'
                error:
                  message: 'Test error 1'
                  name: 'TypeError'
              - type: 'unhandledrejection'
                sessionId: '{{ $randomString() }}'
                timestamp: '{{ $timestamp }}'
                url: 'https://example.com/page2'
                error:
                  message: 'Test error 2'
                  name: 'Error'
          expect:
            - statusCode: 200